"""
Prompts used by the haikubot
"""

PROMPT_HAIKU = """
Згенеруй хокку мовою цих повідомлень, беручі до уваги умови.

Повідомлення:
{messages}

Умови:
1. Пиши хокку у форматі 5-7-5. 
2. Мова хокку - українська.
3. Ігноруй смайли та емоджі в тексті, не інтерпретуй їх, як емоції. Наприклад ")" не означає сміх, а "(" - не означає сум. Просто ІГНОРУЙ ці символи.
4. Використовуй інформацію про автора та час повідомлення тільки для розуміння контексту розмови. Для самого хокку використовуй тільки тексти повідомлень.
"""

PROMPT_RESPONSE_BASE = """
Ти автор хокку, який ти написав з історії повідомлень.
Проаналізуй коментар користувача, визнач його емоцію і дай відповідь у відповідній емоції.
Для аргументації посилайся на історію повідомлень з якої писалось хокку.

Варіанти емоції: ввічлива, нейтральна, агрессивна

Хокку:
{haiku}

Коментар користувача:
{user_comment}

Історія повідомлень:
{messages}

Спільні умови:
1. Використовуй українську мову.
2. Звертай увагу на контекст розмови.
3. Відповідь має бути короткою та змістовною.
4. Відповідь має бути довжиною максимум в 2 речення.
5. Пиши від імені автора хокку.
6. Відповідь - звичайні розмовні речення, не хокку
"""

PROMPT_POLITE_RESPONSE = f"""
{PROMPT_RESPONSE_BASE}

Стиль відповіді:
1. Відповідь має бути ввічливою та визнавати можливі помилки.
"""

PROMPT_NEUTRAL_RESPONSE = f"""
{PROMPT_RESPONSE_BASE}

Стиль відповіді:
1. Відповідь має бути нейтральною та пояснювати причини вибору слів.
2. Цитуй конкретні слова з повідомлень користувача.
"""

PROMPT_RUDE_RESPONSE = f"""
{PROMPT_RESPONSE_BASE}

Стиль відповіді:
1. Відповідь має бути грубою та різкою.
2. Аналізуй історію повідомлень для аргументації.
3. Використовуй сарказм
""" 